{
  "chart": {
    "title": "Oil production",
    "citation": "Energy Institute - Statistical Review of World Energy (2024); The Shift Data Portal (2019)",
    "originalChartUrl": "https://ourworldindata.org/grapher/oil-production-by-country?v=1&csvType=full&useColumnShortNames=false",
    "selection": [
      "Qatar",
      "Oman",
      "Saudi Arabia",
      "Norway",
      "Iraq",
      "United States",
      "United Arab Emirates"
    ]
  },
  "columns": {
    "Oil production (TWh)": {
      "titleShort": "Oil production",
      "titleLong": "Oil production",
      "descriptionShort": "Measured in terawatt-hours.",
      "descriptionKey": [
        "Includes crude oil, shale oil, oil sands, condensates (lease condensate or gas condensates that require further refining) and NGLs (natural gas liquids - ethane, LPG and naphtha separated from the production of natural gas). Excludes liquid fuels from other sources such as biofuels and synthetic derivatives of coal and natural gas. This also excludes liquid fuel adjustment factors such as refinery processing gain. Excludes oil shales/kerogen extracted in solid form."
      ],
      "descriptionProcessing": "- The data is generated by combining the latest data from [the Energy Institute Statistical Review of World Energy](https://www.energyinst.org/statistical-review) and [The Shift Dataportal](https://www.theshiftdataportal.org/energy). The Energy Institute provides fossil fuel production data from 1965 onwards (and crude prices from 1861 onwards). The Shift Dataportal provides long-term data from 1900, but only extends to 2016. To maintain consistency with other energy data, we prioritize the Energy Institute data - meaning if they provide data for the given country and year, this data is used. Where data is not available from the Energy Institute for a given country, or pre-1965 we rely on data from The Shift Dataportal.\n- We have converted primary production in exajoules to terawatt-hours using the conversion factor: 1,000,000 / 3,600 ~ 278.\n- Production per capita has been calculated by dividing by our population dataset, based on [different sources](https://ourworldindata.org/population-sources).",
      "shortUnit": "TWh",
      "unit": "terawatt-hours",
      "timespan": "1900-2023",
      "type": "Numeric",
      "owidVariableId": 943805,
      "shortName": "oil_production__twh",
      "lastUpdated": "2024-06-20",
      "nextUpdate": "2025-06-20",
      "citationShort": "Energy Institute - Statistical Review of World Energy (2024); The Shift Data Portal (2019) – with major processing by Our World in Data",
      "citationLong": "Energy Institute - Statistical Review of World Energy (2024); The Shift Data Portal (2019) – with major processing by Our World in Data. “Oil production” [dataset]. Energy Institute, “Statistical Review of World Energy”; The Shift Data Portal, “Energy production from fossil fuels” [original data].",
      "fullMetadata": "https://api.ourworldindata.org/v1/indicators/943805.metadata.json"
    }
  },
  "dateDownloaded": "2025-02-09",
  "activeFilters": {}
}