{
  "chart": {
    "title": "Share of primary energy consumption from solar",
    "subtitle": "Measured as a percentage of [primary energy](#dod:primaryenergy), using the [substitution method](#dod:substitutionmethod).",
    "citation": "Energy Institute - Statistical Review of World Energy (2024)",
    "originalChartUrl": "https://ourworldindata.org/grapher/solar-share-energy?v=1&csvType=full&useColumnShortNames=false",
    "selection": [
      "Slovenia",
      "Turkey",
      "Thailand",
      "Pakistan",
      "Bangladesh",
      "Canada"
    ]
  },
  "columns": {
    "Solar (% equivalent primary energy)": {
      "titleShort": "Share of primary energy consumption that comes from solar power",
      "titleLong": "Share of primary energy consumption that comes from solar power - Using the substitution method",
      "descriptionShort": "Measured as a percentage of the total primary energy, using the substitution method.",
      "descriptionKey": [
        "Figures are based on gross generation and do not account for cross-border electricity supply.",
        "Primary energy is measured using the \"substitution method\" (also called \"input-equivalent\" primary energy). This method is used for non-fossil sources of electricity (namely renewables and nuclear), and measures the amount of fossil fuels that would be required by thermal power stations to generate the same amount of non-fossil electricity.\nFor example, if a country's nuclear power generated 100 TWh of electricity, and assuming that the efficiency of a standard thermal power plant is 38%, the input-equivalent primary energy for this country would be 100 TWh / 0.38 = 263 TWh = 0.95 EJ. This input-equivalent primary energy takes account of the inefficiencies in energy production from fossil fuels and provides a better approximation of each source's share of energy consumption. You can find more details in [the Statistical Review of World Energy's methodology document](https://www.energyinst.org/__data/assets/pdf_file/0003/1055541/Methodology.pdf)."
      ],
      "shortUnit": "%",
      "unit": "%",
      "timespan": "1965-2023",
      "type": "Numeric",
      "owidVariableId": 944000,
      "shortName": "solar__pct_equivalent_primary_energy",
      "lastUpdated": "2024-06-20",
      "nextUpdate": "2025-06-20",
      "citationShort": "Energy Institute - Statistical Review of World Energy (2024) – with major processing by Our World in Data",
      "citationLong": "Energy Institute - Statistical Review of World Energy (2024) – with major processing by Our World in Data. “Share of primary energy consumption that comes from solar power – Using the substitution method” [dataset]. Energy Institute, “Statistical Review of World Energy” [original data].",
      "fullMetadata": "https://api.ourworldindata.org/v1/indicators/944000.metadata.json"
    }
  },
  "dateDownloaded": "2025-02-09",
  "activeFilters": {}
}